## Pandas Basics
- **Séries**
- **Dataframes**<br>
<br>
- **Ausent Data**
- **Group By**
- **Concatenate, Merge**
- **Operations**
- **Input/Output of data**

# Series

In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a', 'b', 'c']

In [6]:
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

In [8]:
pd.Series(data = minha_lista, index=labels)
#pd.Series(minha_lista,labels)

a    10
b    20
c    30
dtype: int64

In [18]:
ser1 = pd.Series([1, 2, 3, 4], index=['EUA', 'Alemanha', 'URSS', 'Japão'])
ser2 = pd.Series([1, 2, 3, 4], index=['Alemanha', 'EUA', 'Itália', 'Japão'])

In [19]:
ser1 + ser2 # The ideia of pandas is to make operations based on index

Alemanha    3.0
EUA         3.0
Itália      NaN
Japão       8.0
URSS        NaN
dtype: float64

# DataFrame
Is a serie of series
- Creating and Slicing

In [53]:
np.random.seed(101) #seed makes the same output in any instance of jupyter

In [54]:
df = pd.DataFrame(np.random.randn(5, 4), index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df['W']
#df.W  not so usual

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [27]:
type(df['W']) #series.Series

pandas.core.series.Series

In [29]:
df[['W', 'Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [33]:
df['new'] = df['W'] + df['X'] # create a new collumn that is the sum os W and X columns
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [34]:
df.drop('new', axis=1) # drop to delete. axis 1 to column

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [35]:
df # new is still on the source DataFrame

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [ ]:
df.drop('new', axis=1, inplace=True) #inplace delete os source

In [37]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [40]:
 df.loc['A', 'W']
# df.loc['A'] returns line
# df.loc['W'] return column

0.3026654485851825

In [42]:
df.loc[['A', 'B'], ['X', 'Y', 'Z']]

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502

In [43]:
df.iloc[1:4, 2:] # with iloc you get values based on index just like numpy

          Y         Z
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752

## Data Frame pt2

- Conditional Selection
- set_index

In [56]:
df > 0 # example of doing a condition on a DataFrame

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [57]:
bol = df > 0 # attribution to variable bol

In [58]:
df[bol] #doing a selection passing the conditional test

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
df[df['W']>0] # returns only indexes of w that are bigger then 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
df[df['W']>0]["Y"] # returns values of Y columns in which the values from W are biggers then 0
# equivalent of:
# bol = df ['W'] >0
# df2 = df[bol]
# df2['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [61]:
# based on multiple coditions
# df[(df['W']>0) and (df['Y']>1)] #this and does not do good on comparasing series, use & insted. or is |
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [65]:
#index reset
df.reset_index(inplace = True)

In [67]:
col = 'RS RJ SP AM SC'.split()

In [68]:
df['State'] = col

In [70]:
# index set
df.set_index('State', inplace = True) #set Estado as index of df

# Dataframe pt3
- Multilevel Indexes

In [4]:
# Levels of Index
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # contains a list of tuples association each value from one list to another
hier_index = pd.MultiIndex.from_tuples(hier_index) # create multilevel index object

In [14]:
df = pd.DataFrame(np.random.randn(6,2), index = hier_index, columns = ['A', 'B']) # tier dataframe
df

             A         B
G1 1  0.722717  0.838742
   2  0.161504 -1.298171
   3  0.164189 -0.106317
G2 1  1.155554  1.341370
   2  0.227508  0.726843
   3  2.028587  1.616364

In [13]:
df.loc['G1'].loc[1] # series of index 1

A    0.548741
B   -0.352491
Name: 1, dtype: float64

In [15]:
df.index.names = ['Group', 'Number']

In [16]:
df

                     A         B
Group Number
G1    1       0.722717  0.838742
      2       0.161504 -1.298171
      3       0.164189 -0.106317
G2    1       1.155554  1.341370
      2       0.227508  0.726843
      3       2.028587  1.616364

In [17]:
df.xs('G1') # xs = cross section

               A         B
Number
1       0.722717  0.838742
2       0.161504 -1.298171
3       0.164189 -0.106317

In [19]:
df.xs(1, level = 'Number') # output indexes 1 of each group

              A         B
Group
G1     0.722717  0.838742
G2     1.155554  1.341370